{
    "legends": [
        {
            "id":1,
            "name":"Lifeline",
            "role":"Combat Medic",
            "category":"support",
            "legendImage":"LifeLine.jpg",
            "classIcon":"",
            "abilities":[{ 
                "passive":"Combat Medic: Lifeline's passive allows her to tap a knocked teammate in order to revive them, freeing her to continue fighting.",
                "tactical":"D.O.C Healing Drone: After being deployed,  D.O.C. will heal everyone around it at a rate of eight health per second up to a maximum of 150 health.",
                "ultimate":"Care Package: Call down a care package from the sky to bring your team an assortment of 'smart' loot to bolster your loadout."}]
    },{
            "id":2,
            "name":"Bangalore",
            "role":"Professional Soldier",
            "cateogry":"assault",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Double Time: Taking fire while sprinting makes you move faster for a breif moment ",
                "tactical":"Smoke Launcher: Fire a smoke canister that explodes into a cloud of smog on impact.",
                "ultimate":"Rolling Thunder: Calls in an artillery strike that creeps across the landscape."
                }]

    }     
    ,{
            "id":3,
            "name":"Octane",
            "role":"Speed Daredevil",
            "category":"assault",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Swift Mend: Automatically restores health overtime.",
                "tactical":"stim: At the cost of 10% of your health, Ooctane will move 30% faster and 40% faster while sprinting.",
                "ultimate":"Launch Pad: Deploy a jumpad that launhces you and your teammates throught the air."
                }]

    }     
    ,{
            "id":4,
            "name":"Gibraltar",
            "role":"Shielded Fortress",
            "category":"defense",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Gun Shield: Aiming down sights deploys a shield that absorbs incoming fire",
                "tactical":"Dome of Protection: Throws down a dome that blocks any incoming fire.",
                "ultimate":"Defensive Bombardment: Calls down a mortar strike on a particulart location:"
                }]
        }     
    ,{
            "id":5,
            "name":"Bloodhound",
            "role":"Technological Tracker",
            "category":"survey",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Tracker: See tracks left behind by your foes.",
                "tactical":"Eye of the Allfather: Breifly reveal hidden enemies, traps, and clues throughout structures in front of you.",
                "ultimate":"Beast of the Hunt: Enhances your senses, allowing you to move faster and highlighting your prey"
                }]
        }     
    ,{
            "id":6,
            "name":"Pathfinder",
            "role":"Forward Scout",
            "category":"Survey",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Insider Knowledge: Scan a survey beacon to reveal the ring's next location",
                "tactical":"Grappling Hook: Grapple to get to out-of-reach places quickly",
                "ultimate":"Zipline Gun: Create a zipline for everyone to use"
                }]
        }     
    ,{
            "id":7,
            "name":"Wraith",
            "role":"Interdimensional Skirmisher",
            "category":"assault",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Voices from the Void: A voice warns you when danger approaches. As far as you can tell, it's on your side.",
                "tactical":"Into the Void: Reposition quickly through the safety of void space, avoiding all damage",
                "ultimate":"Dimensional Rift: Link two locations with portals for 60 seconds, allowing your entire team to use them."
                }]
        }     
    ,{
            "id":8,
            "name":"Caustic",
            "role":"Toxic Trapper",
            "category":"defense",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Allows you to see enemies through your gas.",
                "tactical":"Drop canisters that release deadly Nox gas when shot or triggered by enemies.",
                "ultimate":"Blankets a large area in Nox gas."
                }]
        }     
    ,{
            "id":9,
            "name":"Wattson",
            "role":"Static Defender",
            "category":"defense",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Spark of Genius: Ultimate Accelerants fully charge your Ultimate Ability",
                "tactical":"Perimeter Security: Connect nodes to create electrified fences that damage and slow enemies.",
                "ultimate":"Interception Pylon: Place an electrified pylon that destroys incoming ornance and repairs damaged shields."
                }]
        }     
    ,{
            "id":10,
            "name":"Loba",
            "role":"Translocating Thief",
            "category":"support",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Eye for Quality: Nearby epic and legendary loot can be seen through walls. The range is the same as Black Marke Boutique.",
                "tactical":"Burglar's Best Friend: Teleport to hard-to-reach places or escape trouble quickly by throwing your Jump Drive bracelet.",
                "ultimate":"Black Market Boutique; Place a portable device that allows you to teleport nearby loot to your inventory. Each friendly or enemy Legend can take up to two items. "
                }]
        }     
    ,{
            "id":11,
            "name":"Mirage",
            "role":"Holographic Trickster",
            "category":"assault",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Now You See Me...:Automatically cloack when using Respawn Beacons and reviving teammates.",
                "tactical":"Psyche Out: Send out a holographic decoy to confuse the enemy.",
                "ultimate":"Life of the Party: Deploy a team of Decoys to distract enemies."
                }]
        }     
    ,{
            "id":12,
            "name":"Horizon",
            "role":"Gravitational Manipulator",
            "category":"assault",
            "legendImage":"",
            "classIcon":"",
            "abilities":[{
                "passive":"Spacewalk: Increase air control and reduce fall impacts with Horizon's custom spacesuit.",
                "tactical":"Gravity Lift: Reverses the flow of gravity, lifting players upwards and boosting them outward when they exit.",
                "ultimate":"Black Hole: Deploy N.E.W.T to create a micro black hole that pulls players in towards it, and hits them with a graviton blast at the end."
                }]
        }     
        ]
        }